<?php
error_reporting(E_ALL);
ini_set("max_execution_time",0);
//phpinfo();
include "./funs.php";







//third(5.40,5.1,1.71,500);

#日乙初盘 柏太阳神
two(4.7,1.1,100);

//开场10分钟，小0.5 1.58
//20分钟时，大0.5 0.86;小0.5 1.04
//22分钟时，大0.5 0.94;小0.5 0.96
//如果在10--20分钟不进球，就可以这么买


//日乙初盘（01，23）
//two(3.6,2,100);
//two(3.55,1.93,100); 5分钟

#澳国超附
//two(1.9,4.6,50); 25分钟

//two(2.17,1.92,20);
#美职业 10点的（23，456）
//two(1.7,2.5,50);


#美职业 10点的（23，456）
//two(2.12,2.66,50);  10分钟
//two(2.0,2.75,50);  15分钟
//two(1.97,2.92,50);  20分钟
//two(1.93,3.3,50);  25分钟
//two(1.91,3.6,50);  30分钟 （进球，1：0）
//two(1.87,2.3,50);  35分钟 （进球，1：0）
//two(1.78,2.46,50);  40分钟 （进球，1：0）
//two(1.70,2.77,50);  中场 （进球，1：0）
//two(1.68,2.9,50);  下半场开场 （进球，1：1）
//two(2.33,1.5,50);  75分钟 （进球，2：1）

//巴西甲早场（01，23）
//two(2.4,1.89,20); 15分钟
//two(2.31,1.9,20); 20分钟
//two(2.19,1.94,20); 25分钟
//two(1.83,2.1,20); 35分钟
//two(1.73,2.18,20); 40分钟

//墨联，半场30分钟进3球，此时（23，456）
//two(8.6,1.33,50);


#荷甲，鹿特丹斯巴达初盘（23，456）
//two(2.17,1.92,20);
//荷甲5分钟后
//two(2.29,2.26,100);
//two(2.18,2.41,100);10分钟（14分钟进球了，太快了）
//two(2.52,1.76,100);15分钟（1：0）
//two(2.4,1.8,100);20分钟（1：0）
//two(2.17,1.92,100);25分钟（1：0）
//two(2.1,2,100);30分钟（1：0）

//日乙，半场0：1的时候（01,23)
//two(2.72,1.6,100);

//是一个英冠（23，456）
//two(2.39,2.15,100);
//two(1.62,3.55,50);


// 这是一个葡甲的初盘（23，456）
//two(1.96,3.3,100);
//10分钟后（1.98，3.4)
//35分钟后（2，4.85)
//35分钟后（2，4.85)

//英冠利兹联 70分钟，来了一个点球（没进）
//two(1.56,8.7,100);

//是一个芬超的初盘（23，456），滚球盘会随着时间不断涨水
//23球会降水，456会涨水，一般整体还是属于涨水,
//two(2,3.4,100);
//开场一般10分钟后变化非常大，two(1.96,4,100);
//  15分钟后，two(1.96,4.6,100);
//  20分钟后，two(1.99,5.2,100);注意，23球也开始涨水了
//  25分钟后，two(1.94,5.6,100);
//  30分钟后，two(1.96,6.1,100);  31分钟进球



//中超半场1：0的时候，可以上，但是水很低。可以下半场50，60之间再上
//1：0半场结束，目前水位
//two(1.6,9.5,100);


//中超65分钟
//two(1.6,7.0,100);

//中超70分钟
//two(1.6,9,100);

//中超72分钟
//two(1.6,11,100);
// 80分钟的时候进球，2：0

//半场日乙就进俩球，倍率变成1。8
//two(1.93,1.79,100);


//third(5.6,1.65,3.1,100);

//third(2.70,2.01,4.0,500);


//半场进球时的均（1，2，3+）
//third(2.1,1.64,12,100);

//半场进1球后，买（23，46，7+）
//third(1.57,4.85,41,20);
//third(1.82,0.92,2.75,500);
//third(1.67,0.99,3.2,100);

//小球的比赛
//半场进1球后，买（23，46）
//two(0.57,5.2,500);


//four(2.43,1.92,5,36,200);

//four(3.55,2.05,3.10,18.0,100);



//尝试成功
//滚盘（23，46）在半场进了一球的时候买的,随着时间的推移，这些赔率都还涨,一场澳甲的友谊赛，墨尔本vs帕斯光荣
//大概60分钟的时候是，(1.58,8.8)，64分钟的时候（1.59,9.8),72分钟（1.69,15)，13:30,（1.82,21）13:36(81分钟),（2.4,41）
//13:40(85分钟),（2.79,41）,13:41(86分钟)（2.79,41）进球了,最终2：0。
//赢得5。3
//two(1.58,3.90,100);